Revit 2024 API
RenderingQualitySettings.IsValidRenderTime Method
 Validate the render time is between 1 and 32768.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool IsValidRenderTime(
	int value
)
Visual Basic
Public Function IsValidRenderTime ( _
	value As Integer _
) As Boolean
Visual C++
public:
bool IsValidRenderTime(
	int value
)
Parameters
value
Type: System.Int32
 The render time value to validate.
Return Value
 True if the value is in the proper range, false otherwise.
See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace